#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.prod.random_string.suffix: Refreshing state... [id=kk1z]
module.dev.random_string.suffix: Refreshing state... [id=5wfm]
module.qa.random_string.suffix: Refreshing state... [id=3qjc]
module.qa.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-qa-rg]
module.prod.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-prod-rg]
module.dev.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-dev-rg]
module.prod.azurerm_consumption_budget_resource_group.budget: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-prod-rg/providers/Microsoft.Consumption/budgets/practice-lab-prod-budget]
module.prod.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-prod-rg/providers/Microsoft.Web/serverFarms/practice-lab-prod-asp]
module.qa.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-qa-rg/providers/Microsoft.Web/serverFarms/practice-lab-qa-asp]
module.prod.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-prod-rg/providers/Microsoft.Storage/storageAccounts/practicelabprodstorekk1z]
module.qa.azurerm_consumption_budget_resource_group.budget: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-qa-rg/providers/Microsoft.Consumption/budgets/practice-lab-qa-budget]
module.qa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-qa-rg/providers/Microsoft.Storage/storageAccounts/practicelabqastore3qjc]
module.dev.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-dev-rg/providers/Microsoft.Web/serverFarms/practice-lab-dev-asp]
module.dev.azurerm_consumption_budget_resource_group.budget: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-dev-rg/providers/Microsoft.Consumption/budgets/practice-lab-dev-budget]
module.dev.azurerm_cosmosdb_account.db[0]: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-dev-rg/providers/Microsoft.DocumentDB/databaseAccounts/practice-lab-dev-cosmos]
module.dev.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-dev-rg/providers/Microsoft.Storage/storageAccounts/practicelabdevstore5wfm]
module.prod.azurerm_linux_web_app.app: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-prod-rg/providers/Microsoft.Web/sites/practice-lab-prod-app]
module.qa.azurerm_linux_web_app.app: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-qa-rg/providers/Microsoft.Web/sites/practice-lab-qa-app]
module.dev.azurerm_linux_web_app.app: Refreshing state... [id=/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-dev-rg/providers/Microsoft.Web/sites/practice-lab-dev-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "centralus"
      + name                                  = "practice-lab-dev-ai"
      + resource_group_name                   = "practice-lab-dev-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.dev.azurerm_consumption_budget_resource_group.budget must be replaced
-/+ resource "azurerm_consumption_budget_resource_group" "budget" {
      ~ etag              = "\"1dc9b87f78cfbfa\"" -> (known after apply)
      ~ id                = "/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-dev-rg/providers/Microsoft.Consumption/budgets/practice-lab-dev-budget" -> (known after apply)
        name              = "practice-lab-dev-budget"
        # (3 unchanged attributes hidden)

      ~ time_period {
          ~ end_date   = "2036-02-01T00:00:00Z" -> (known after apply)
          ~ start_date = "2026-02-01T00:00:00Z" -> (known after apply) # forces replacement
        }

        # (3 unchanged blocks hidden)
    }

  # module.dev.azurerm_linux_web_app.app will be updated in-place
  ~ resource "azurerm_linux_web_app" "app" {
      ~ app_settings                                   = {} -> (known after apply)
        id                                             = "/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-dev-rg/providers/Microsoft.Web/sites/practice-lab-dev-app"
        name                                           = "practice-lab-dev-app"
        tags                                           = {}
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev.azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "centralus"
      + name                            = "practice-lab-dev-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "practice-lab-dev-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.prod.azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "centralus"
      + name                                  = "practice-lab-prod-ai"
      + resource_group_name                   = "practice-lab-prod-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.prod.azurerm_consumption_budget_resource_group.budget must be replaced
-/+ resource "azurerm_consumption_budget_resource_group" "budget" {
      ~ etag              = "\"1dc9b87f837feec\"" -> (known after apply)
      ~ id                = "/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-prod-rg/providers/Microsoft.Consumption/budgets/practice-lab-prod-budget" -> (known after apply)
        name              = "practice-lab-prod-budget"
        # (3 unchanged attributes hidden)

      ~ time_period {
          ~ end_date   = "2036-02-01T00:00:00Z" -> (known after apply)
          ~ start_date = "2026-02-01T00:00:00Z" -> (known after apply) # forces replacement
        }

        # (3 unchanged blocks hidden)
    }

  # module.prod.azurerm_linux_web_app.app will be updated in-place
  ~ resource "azurerm_linux_web_app" "app" {
      ~ app_settings                                   = {} -> (known after apply)
        id                                             = "/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-prod-rg/providers/Microsoft.Web/sites/practice-lab-prod-app"
        name                                           = "practice-lab-prod-app"
        tags                                           = {}
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod.azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "centralus"
      + name                            = "practice-lab-prod-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "practice-lab-prod-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.qa.azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "centralus"
      + name                                  = "practice-lab-qa-ai"
      + resource_group_name                   = "practice-lab-qa-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.qa.azurerm_consumption_budget_resource_group.budget must be replaced
-/+ resource "azurerm_consumption_budget_resource_group" "budget" {
      ~ etag              = "\"1dc9b87f7262024\"" -> (known after apply)
      ~ id                = "/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-qa-rg/providers/Microsoft.Consumption/budgets/practice-lab-qa-budget" -> (known after apply)
        name              = "practice-lab-qa-budget"
        # (3 unchanged attributes hidden)

      ~ time_period {
          ~ end_date   = "2036-02-01T00:00:00Z" -> (known after apply)
          ~ start_date = "2026-02-01T00:00:00Z" -> (known after apply) # forces replacement
        }

        # (3 unchanged blocks hidden)
    }

  # module.qa.azurerm_linux_web_app.app will be updated in-place
  ~ resource "azurerm_linux_web_app" "app" {
      ~ app_settings                                   = {} -> (known after apply)
        id                                             = "/subscriptions/5bf1827b-dd4e-4201-8bf4-ed6ef64b8c37/resourceGroups/practice-lab-qa-rg/providers/Microsoft.Web/sites/practice-lab-qa-app"
        name                                           = "practice-lab-qa-app"
        tags                                           = {}
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.qa.azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "centralus"
      + name                            = "practice-lab-qa-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "practice-lab-qa-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

Plan: 9 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ignacio-null, Action: `pull_request`*